nc: 80
scales: 
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

# backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, PSA, [1024]] # 10

# YOLOv10n Ghost-Head
head:
  # [from, repeats, module, args]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12
  - [-1, 3, C3Ghost, [512]] 

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15
  - [-1, 3, C3Ghost, [256]] # 16 


  - [-1, 1, GhostConv, [256, 3, 2]] # 17
  - [[-1, 13], 1, Concat, [1]] # 18

  - [-1, 3, C3Ghost, [512]] # 19 

  - [-1, 1, GhostConv, [512, 3, 2]] # 20
  - [[-1, 10], 1, Concat, [1]] # 21

  - [-1, 3, C3Ghost, [1024]] # 22

  - [[16, 19, 22], 1, v10Detect, [nc]] # Detect