nc: 80 
scales: 
n: [0.33, 0.25, 1024]
# [depth, width, max_channels]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ZeroDCEPlusPlusYOLO, [3, 3, 0.5]]        
  - [-1, 1, Conv, [64, 3, 2]]                        
  - [-1, 1, Conv, [128, 3, 2]]                       
  - [-1, 3, C2f, [128, True]]                      
  - [-1, 1, Conv, [256, 3, 2]]                     
  - [-1, 6, C2f, [256, True]]                        
  - [-1, 1, SCDown, [512, 3, 2]]                     
  - [-1, 6, C2fPSA, [512, True]]                     
  - [-1, 1, SCDown, [1024, 3, 2]]                    
  - [-1, 3, C2fPSA, [1024, True]]                    
  - [-1, 1, SPPF, [1024, 5]]                       
  - [-1, 1, PSA, [1024]]                             

head:
  
head:

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       
  - [[-1, 7], 1, Concat, [1]]                        
  - [-1, 3, C3Ghost_CBAM, [512]]                     

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       
  - [[-1, 5], 1, Concat, [1]]                        
  - [-1, 3, C3Ghost_CBAM, [256]]                     

  - [17, 1, GhostConv, [256, 3, 2]]                  
  - [[-1, 14], 1, Concat, [1]]                       
  - [-1, 3, C3Ghost_CBAM, [512]]                     

  - [20, 1, GhostConv, [512, 3, 2]]                  
  - [[-1, 11], 1, Concat, [1]]                       
  - [-1, 3, C3Ghost_CBAM, [1024]]                    

  - [[17, 20, 23], 1, v10Detect, [nc]]               